app/controllers/students_controller.rb

  def create
    @student = Student.new
    @student.first_name = params[:student][:first_name]
    @student.last_name = params[:student][:last_name]
    @student.save(params.require(:student).permit(:first_name, :last_name))
---
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-11-17 10:06:05.992899"], ["updated_at", "2021-11-17 10:06:05.992899"]]